class Users:
    
    user_1 = {
        "name": "Юлия",
        "surname": "Павлова",
        "address": "Москва, ул. Пушкина, 1",
        "subway": "Чистые пруды",
        "phone": "79995554444",
        "date": "10.11.2025",
        "period_type": "сутки", 
        "color": "черный жемчуг",
        "comment": "оставить у подъезда"
    }
    
    user_2 = {
        "name": "Антон",
        "surname": "Песков",
        "address": "Санкт- Петербург",
        "subway": "Комсомольская",
        "phone": "79995554444",
        "date": "14.11.2025",
        "period_type": "трое суток", 
        "color": "серая безысходность",
        "comment": "не звонить"
    }

class FAQ:
    expected_texts = [
        "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
        "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
        "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
        "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
        "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
        "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
        "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
        "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    ]